#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть строка с перечислением фильмов

my_favorite_movies = 'Терминатор, Пятый элемент, Аватар, Чужие, Назад в будущее'

# Выведите на консоль с помощью индексации строки, последовательно:
#   первый фильм
#   последний
#   второй
#   второй с конца

# Запятая не должна выводиться.  Переопределять my_favorite_movies нельзя
# Использовать .split() или .find()или другие методы строки нельзя - пользуйтесь только срезами,
# как указано в задании!

first_movie = "Терминатор"
second_movie = "Пятый элемент"
third_movie = "Аватар"
fourth_movie = "Чужие"
fifth_movie = "Назад в будущее"

print(first_movie , fifth_movie, second_movie, fourth_movie)

'Терминаторпятыйэлементаватарчужиеназадвбудущее'[0:10]

'qwerty'[5]









