#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)

my_family = ['igor', 'alice', 'elena']

# список списков приблизителного роста членов вашей семьи

my_family_height = [['igor', 178], ['alice',60 ], ['elena',164]]
igor_height= 178
alice_height= 60
elena_height= 164
print('my husbands height is', igor_height, 'cm')

    # ['имя', рост],
# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см

print('my familys height is', igor_height+alice_height+elena_height ,'cm')
